; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v5 ?v3)
             (pred_12 ?v10 ?v7)
             (pred_4 ?v5 ?v7)
             (pred_7 ?v13 ?v5 )
	     (pred_2 ?v5)
             (pred_9 ?v9)
             (pred_5 ?v10)
             (pred_8 ?v7)
             (pred_1 ?v5)
             (pred_10 ?v10)
             (pred_11 ?v5)
             (pred_3 ))



(:action op_1
:parameters (?v11 ?v8 ?v6 ?v1)
:precondition (and (pred_9 ?v11) (pred_9 ?v8) (pred_5 ?v6) (pred_8 ?v1)
          (pred_6 ?v11 ?v8) (pred_12 ?v6 ?v1)
                   (pred_4 ?v8 ?v1) (pred_2 ?v11) 
                   (pred_1 ?v8) (pred_10 ?v6))
:effect (and  (pred_11 ?v8) (not (pred_1 ?v8))))


(:action op_5
:parameters (?v11 ?v4)
:precondition (and (pred_9 ?v11) (pred_9 ?v4)
               (pred_2 ?v11) (pred_6 ?v11 ?v4) (pred_11 ?v4))
:effect (and (pred_2 ?v4) (not (pred_2 ?v11))))

(:action op_4
:parameters (?v11 ?v6)
:precondition (and (pred_9 ?v11) (pred_5 ?v6) 
                  (pred_2 ?v11) (pred_7 ?v6 ?v11) (pred_3 ))
:effect (and (pred_10 ?v6)
   (not (pred_7 ?v6 ?v11)) (not (pred_3 ))))


(:action op_2
:parameters (?v11 ?v2 ?v12)
:precondition (and (pred_9 ?v11) (pred_5 ?v2) (pred_5 ?v12)
                  (pred_2 ?v11) (pred_10 ?v12) (pred_7 ?v2 ?v11))
:effect (and (pred_10 ?v2) (pred_7 ?v12 ?v11)
        (not (pred_10 ?v12)) (not (pred_7 ?v2 ?v11))))

(:action op_3
:parameters (?v11 ?v6)
:precondition (and (pred_9 ?v11) (pred_5 ?v6) 
                  (pred_2 ?v11) (pred_10 ?v6))
:effect (and (pred_3 ) (pred_7 ?v6 ?v11) (not (pred_10 ?v6)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_21 obj_06 obj_31 obj_23 obj_16 obj_28 obj_13 obj_26 obj_12 obj_29 obj_14 obj_08 obj_19 obj_15 obj_17 obj_03 obj_25 obj_10 obj_24 obj_27 obj_09 obj_02 obj_01 obj_22
    obj_05 obj_04 obj_07
    obj_20 obj_30 obj_18
    )

    (:init
       (pred_3)

       (pred_9 obj_11)
       (pred_9 obj_21)
       (pred_9 obj_06)
       (pred_9 obj_31)
       (pred_9 obj_23)
       (pred_9 obj_16)
       (pred_9 obj_28)
       (pred_9 obj_13)
       (pred_9 obj_26)
       (pred_9 obj_12)
       (pred_9 obj_29)
       (pred_9 obj_14)
       (pred_9 obj_08)
       (pred_9 obj_19)
       (pred_9 obj_15)
       (pred_9 obj_17)
       (pred_9 obj_03)
       (pred_9 obj_25)
       (pred_9 obj_10)
       (pred_9 obj_24)
       (pred_9 obj_27)
       (pred_9 obj_09)
       (pred_9 obj_02)
       (pred_9 obj_01)
       (pred_9 obj_22)
       (pred_8 obj_05)
       (pred_8 obj_04)
       (pred_8 obj_07)
       (pred_5 obj_20)
       (pred_5 obj_30)
       (pred_5 obj_18)

       (pred_6 obj_11 obj_16)
       (pred_6 obj_11 obj_21)
       (pred_6 obj_21 obj_28)
       (pred_6 obj_21 obj_06)
       (pred_6 obj_21 obj_11)
       (pred_6 obj_06 obj_13)
       (pred_6 obj_06 obj_31)
       (pred_6 obj_06 obj_21)
       (pred_6 obj_31 obj_26)
       (pred_6 obj_31 obj_23)
       (pred_6 obj_31 obj_06)
       (pred_6 obj_23 obj_12)
       (pred_6 obj_23 obj_31)
       (pred_6 obj_16 obj_29)
       (pred_6 obj_16 obj_28)
       (pred_6 obj_16 obj_11)
       (pred_6 obj_28 obj_14)
       (pred_6 obj_28 obj_13)
       (pred_6 obj_28 obj_21)
       (pred_6 obj_28 obj_16)
       (pred_6 obj_13 obj_08)
       (pred_6 obj_13 obj_26)
       (pred_6 obj_13 obj_06)
       (pred_6 obj_13 obj_28)
       (pred_6 obj_26 obj_19)
       (pred_6 obj_26 obj_12)
       (pred_6 obj_26 obj_31)
       (pred_6 obj_26 obj_13)
       (pred_6 obj_12 obj_15)
       (pred_6 obj_12 obj_23)
       (pred_6 obj_12 obj_26)
       (pred_6 obj_29 obj_17)
       (pred_6 obj_29 obj_14)
       (pred_6 obj_29 obj_16)
       (pred_6 obj_14 obj_03)
       (pred_6 obj_14 obj_08)
       (pred_6 obj_14 obj_28)
       (pred_6 obj_14 obj_29)
       (pred_6 obj_08 obj_25)
       (pred_6 obj_08 obj_19)
       (pred_6 obj_08 obj_13)
       (pred_6 obj_08 obj_14)
       (pred_6 obj_19 obj_10)
       (pred_6 obj_19 obj_15)
       (pred_6 obj_19 obj_26)
       (pred_6 obj_19 obj_08)
       (pred_6 obj_15 obj_24)
       (pred_6 obj_15 obj_12)
       (pred_6 obj_15 obj_19)
       (pred_6 obj_17 obj_27)
       (pred_6 obj_17 obj_03)
       (pred_6 obj_17 obj_29)
       (pred_6 obj_03 obj_09)
       (pred_6 obj_03 obj_25)
       (pred_6 obj_03 obj_14)
       (pred_6 obj_03 obj_17)
       (pred_6 obj_25 obj_02)
       (pred_6 obj_25 obj_10)
       (pred_6 obj_25 obj_08)
       (pred_6 obj_25 obj_03)
       (pred_6 obj_10 obj_01)
       (pred_6 obj_10 obj_24)
       (pred_6 obj_10 obj_19)
       (pred_6 obj_10 obj_25)
       (pred_6 obj_24 obj_22)
       (pred_6 obj_24 obj_15)
       (pred_6 obj_24 obj_10)
       (pred_6 obj_27 obj_09)
       (pred_6 obj_27 obj_17)
       (pred_6 obj_09 obj_02)
       (pred_6 obj_09 obj_03)
       (pred_6 obj_09 obj_27)
       (pred_6 obj_02 obj_01)
       (pred_6 obj_02 obj_25)
       (pred_6 obj_02 obj_09)
       (pred_6 obj_01 obj_22)
       (pred_6 obj_01 obj_10)
       (pred_6 obj_01 obj_02)
       (pred_6 obj_22 obj_24)
       (pred_6 obj_22 obj_01)
       (pred_1 obj_14)
       (pred_1 obj_21)
       (pred_1 obj_10)
       (pred_4  obj_14 obj_05)
       (pred_4  obj_21 obj_04)
       (pred_4  obj_10 obj_07)
       (pred_11 obj_11)
       (pred_11 obj_06)
       (pred_11 obj_31)
       (pred_11 obj_23)
       (pred_11 obj_16)
       (pred_11 obj_28)
       (pred_11 obj_13)
       (pred_11 obj_26)
       (pred_11 obj_12)
       (pred_11 obj_29)
       (pred_11 obj_08)
       (pred_11 obj_19)
       (pred_11 obj_15)
       (pred_11 obj_17)
       (pred_11 obj_03)
       (pred_11 obj_25)
       (pred_11 obj_24)
       (pred_11 obj_27)
       (pred_11 obj_09)
       (pred_11 obj_02)
       (pred_11 obj_01)
       (pred_11 obj_22)

       (pred_12  obj_20 obj_05)
       (pred_12  obj_30 obj_04)
       (pred_12  obj_18 obj_07)
       (pred_7 obj_20 obj_16)
       (pred_7 obj_30 obj_15)
       (pred_7 obj_18 obj_26)
       (pred_2 obj_15)
    )

    (:goal (and
       (pred_7 obj_20 obj_08)
       (pred_7 obj_30 obj_27)
    ))
(:constraints
  (always (not (pred_2 obj_17)))
)
)

; plan
1. (op_5 obj_15 obj_19)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_19)
   goals met: 0 of 2
2. (op_5 obj_19 obj_08)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_08)
   goals met: 0 of 2
3. (op_5 obj_08 obj_13)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_13)
   goals met: 0 of 2
4. (op_5 obj_13 obj_28)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_28)
   goals met: 0 of 2
5. (op_5 obj_28 obj_16)
   deleted: (pred_2 obj_28)
   added: (pred_2 obj_16)
   goals met: 0 of 2
6. (op_4 obj_16 obj_20)
   deleted: (pred_7 obj_20 obj_16) (pred_3)
   added: (pred_10 obj_20)
   goals met: 0 of 2
7. (op_5 obj_16 obj_29)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_29)
   goals met: 0 of 2
8. (op_1 obj_29 obj_14 obj_20 obj_05)
   deleted: (pred_1 obj_14)
   added: (pred_11 obj_14)
   goals met: 0 of 2
9. (op_5 obj_29 obj_14)
   deleted: (pred_2 obj_29)
   added: (pred_2 obj_14)
   goals met: 0 of 2
10. (op_5 obj_14 obj_08)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_08)
   goals met: 0 of 2
11. (op_3 obj_08 obj_20)
   deleted: (pred_10 obj_20)
   added: (pred_3) (pred_7 obj_20 obj_08)
   goals met: 1 of 2
12. (op_5 obj_08 obj_19)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_19)
   goals met: 1 of 2
13. (op_5 obj_19 obj_15)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_15)
   goals met: 1 of 2
14. (op_4 obj_15 obj_30)
   deleted: (pred_7 obj_30 obj_15) (pred_3)
   added: (pred_10 obj_30)
   goals met: 1 of 2
15. (op_5 obj_15 obj_19)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_19)
   goals met: 1 of 2
16. (op_5 obj_19 obj_08)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_08)
   goals met: 1 of 2
17. (op_5 obj_08 obj_14)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_14)
   goals met: 1 of 2
18. (op_5 obj_14 obj_03)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_03)
   goals met: 1 of 2
19. (op_5 obj_03 obj_09)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_09)
   goals met: 1 of 2
20. (op_5 obj_09 obj_27)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_27)
   goals met: 1 of 2
21. (op_3 obj_27 obj_30)
   deleted: (pred_10 obj_30)
   added: (pred_3) (pred_7 obj_30 obj_27)
   goals met: 2 of 2
